In [3]:
import pandas as pd

In [4]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [5]:
df=pd.DataFrame(dict1)

In [6]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top 3 Rows of The Dataset

In [7]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Display Last 3 Rows of The Dataset

In [8]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find the number of Rows & Columns of our Dataset (Shape)

In [9]:
df.shape

(7, 3)

# 4. Find other information

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check Null Values in the Dataset

In [11]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [12]:
df.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

# 6. Get Overall Statistics about the Dataset

In [14]:
df.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. Find Unique Values from The Gender Column

In [15]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

#  8. Find Number of unique values from The Gender Column

In [16]:
df['Gender'].nunique()

2

# 9. Find Count of unique values from The Gender Column

In [17]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find the total Number of Students having marks between 90-100 (Inclusive)

In [18]:
#First Using Simple Method

In [19]:
df['Marks'] >= 90    #Now pass this to our DataFrame

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [20]:
df[ df['Marks'] >= 90 ]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [62]:
#Now Using AND Condition

In [21]:
(df['Marks'] >= 90)  &  (df['Marks'] <= 100)     #Now put this into a df

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [22]:
df[ (df['Marks'] >= 90)  &  (df['Marks'] <= 100) ]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [67]:
#Now using the 'BEtWEEN' method

In [23]:
sum( df['Marks'].between(90,100) )

4

# 11. Find Average Marks

In [24]:
df['Marks'].mean()

92.14285714285714

# 12. How to Apply Methods to our DataFrame (using 'apply()' method)

In [25]:
def half_it(x):
    return x//2

In [26]:
df['Half_Marks'] = df['Marks'].apply(half_it)

In [27]:
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [90]:
#Lets apply 'Lembda Function'

In [30]:
df['Marks'].apply( lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [31]:
#If we want to apply the length method to the Name column

In [34]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map Function

In [38]:
df['Male_Female'] = df['Gender'].map({'Male':1, 'Female':0})

In [39]:
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

# 14. Drop the Column(s)

In [44]:
df.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [46]:
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [47]:
df.drop( ['Male_Female', 'Half_Marks'], axis=1, inplace=True)

In [50]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print the Name of the Columns

In [51]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [52]:
df.index

RangeIndex(start=0, stop=7, step=1)

# 16. Sort the DataFrame as per the Marks Column

In [58]:
df.sort_values(by='Marks',  ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

# 17. Display Name and Marks of Female students only

In [71]:
df[ df['Gender'] == 'Female' ]  [ ['Name', 'Marks'] ]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [73]:
#Now using 'isin' mathod

In [79]:
df [df['Gender'].isin( ['Female'] )] [ ['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99